Конфигурация/src/Documents/УслугиОтеля/УслугиОтеля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УслугиОтеля</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоБроням</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПоУслугам</registerRecords>
  <attributes>
    <name>Гость</name>
    <type>
      <types>CatalogRef.Гости</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Бронь</name>
      <type>
        <types>DocumentRef.БронированиеНомера</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/AccumulationRegisters/ВзаиморасчетыПоБроням/ВзаиморасчетыПоБроням.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыПоБроням</name>
  <comment>Учет оплаты номеров</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Бронь</name>
    <type>
      <types>DocumentRef.БронированиеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Гость</name>
    <type>
      <types>CatalogRef.Гости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидДвижения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/AccumulationRegisters/ЗадолженностьПоУслугам/ЗадолженностьПоУслугам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗадолженностьПоУслугам</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Гость</name>
    <type>
      <types>CatalogRef.Гости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидДвижения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/AccumulationRegisters/ДоходыРасходы/ДоходыРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДоходыРасходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипСтатьи</name>
    <type>
      <types>CatalogRef.Статьи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/Enums/ВидДвижения/ВидДвижения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидДвижения</name>
  <enumValues>
    <name>Оплата</name>
  </enumValues>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
</mdclass:Enum>

Конфигурация/src/Documents/УслугиОтеля/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

    Движения.ВзаиморасчетыПоБроням.Записывать = Истина;
    Движения.ЗадолженностьПоУслугам.Записывать = Истина;
    Движения.ДоходыРасходы.Записывать = Истина;
    

    // Группируем суммы по броням из табличной части
    СуммыПоБроням = Новый Соответствие;

    Для Каждого Строка Из Услуги Цикл
        ТекущаяСумма = СуммыПоБроням.Получить(Строка.Бронь);
        Если ТекущаяСумма = Неопределено Тогда
            ТекущаяСумма = 0;
        КонецЕсли;
        СуммыПоБроням.Вставить(Строка.Бронь, ТекущаяСумма + Строка.Сумма);
    КонецЦикла;

    // Формируем движения по каждой брони
    Для Каждого Строки Из СуммыПоБроням Цикл
        Движение = Движения.ВзаиморасчетыПоБроням.Добавить();
        Движение.Период = Дата;
        Движение.Бронь = Строки.Ключ;
        Движение.Гость = Гость;
        Движение.Сумма = Строки.Значение;
        Движение.Вид = Перечисления.ВидДвижения.Оплата;
    КонецЦикла;

    // Группируем услуги (схлопываем одинаковые)
    СуммыПоУслугам = Новый Соответствие;

    Для Каждого Строка Из Услуги Цикл
        ТекущаяСумма = СуммыПоУслугам.Получить(Строка.Услуга);
        Если ТекущаяСумма = Неопределено Тогда
            ТекущаяСумма = 0;
        КонецЕсли;
        СуммыПоУслугам.Вставить(Строка.Услуга, ТекущаяСумма + Строка.Сумма);
    КонецЦикла;

    // Формируем движения по услугам
    ИтоговаяСумма = 0;
    Для Каждого Строки Из СуммыПоУслугам Цикл
        ДвижениеУслуги = Движения.ЗадолженностьПоУслугам.Добавить();
        ДвижениеУслуги.Период = Дата;
        ДвижениеУслуги.Гость = Гость;
        ДвижениеУслуги.Услуга = Строки.Ключ;
        ДвижениеУслуги.Сумма = Строки.Значение;
        ДвижениеУслуги.Вид = Перечисления.ВидДвижения.Оплата;
        ИтоговаяСумма = ИтоговаяСумма + Строки.Значение;
    КонецЦикла;
	    Движение = Движения.ДоходыРасходы.Добавить();
        Движение.Период = НачалоМесяца(Дата);
        Движение.Сумма = ИтоговаяСумма;	
        Движение.ТипСтатьи = Справочники.Статьи.ВыручкаОтПродажи;
КонецПроцедуры
